---
kind: method
id: M:Autodesk.Revit.UI.ExternalApplicationArrayIterator.#ctor
source: html/9a2f39a8-2bfe-c33d-8162-58236c24d284.htm
---
# Autodesk.Revit.UI.ExternalApplicationArrayIterator.#ctor Method

For Internal Use Only.

## Syntax (C#)
```csharp
public ExternalApplicationArrayIterator()
```

## Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.